print('\nЗадача task.1. .\n')

# РЕШЕНИЕ
# Напишите программу, которая выводит квадраты чисел от 0 до 10.
# Для этого используйте цикл for и функцию range.


# =============================





# region {===== Основной код =====}

for number in range(11):
	print(number ** 2)

# endregion {===== Основной код =====}