print('\nЗадача task.2. .\n')

# РЕШЕНИЕ
# Арина считает, что всё в нашей жизни закономерно. И она в очередной раз убедилась в этом,
# когда узнала своё домашнее задание по математике.

# Напишите программу, которая выводит на экран вот такую последовательность чисел (каждое число в новой строчке):
# =============================


# region {===== Основной код =====}
number = 7
x = 7

print(number)

while number != 98:
	number += x

	print(number)

# endregion {===== Основной код =====}
