print('\nЗадача task.1. .\n')

# РЕШЕНИЕ
# напишите программу которая выводит сообщение "Я программист!" 5 раз
# используя while
# =============================





# region {===== Основной код =====}

count_words = 0
word = "Я програмист!"

while count_words != 5:

	print(word)
	count_words += 1

# endregion {===== Основной код =====}