print('\nЗадача task.2. .\n')

# РЕШЕНИЕ
# Напишите программу, которая имитировала бы часы с кукушкой.
# В начале работы она спрашивает, который час, а затем нужное количество раз пишет “Ку-ку!”.
# =============================





# region {===== Основной код =====}

hours = int(input("Сколько сейчас часов ? "))

for kukushka in range(hours):
	print("ку-ку")

# endregion {===== Основной код =====}