print('\nЗадача task.1. .\n')

# РЕШЕНИЕ
# Напишите программу, которая выводит кубы чисел (число в третьей степени), лежащих в диапазоне от 1 до 10.
# =============================





# region {===== Основной код =====}

for number in range(1,11):
	print(number ** 3)

# endregion {===== Основной код =====}